Revit 2024 API
BuiltInFailures.WallFailures.CurtainOrStackedWallDisallowedForCrossSectionType Property
 Curtain wall types and Stacked wall types are not allowed for this wall's cross-section type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CurtainOrStackedWallDisallowedForCrossSectionType { get; }
Visual Basic
Public Shared ReadOnly Property CurtainOrStackedWallDisallowedForCrossSectionType As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CurtainOrStackedWallDisallowedForCrossSectionType {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.WallFailures Class
Autodesk.Revit.DB Namespace